<?php
error_reporting(0);
date_default_timezone_set("Asia/Shanghai");
$id = isset($_GET['id']) ? $_GET['id'] : 'cctv1';
$n = [
    'd93cctv1' => '3221226231', // CCTV1			
    'D93CCTV1' => '3221226231', // CCTV1			
    'D93CCTV2' => '3221226195', // CCTV2			
    'D93CCTV3' => '3221226397', // CCTV3			
    'D93CCTV4' => '3221226223', // CCTV4			
    'D93CCTV5' => '3221226395', // CCTV-5			
    'D93CCTV50' => '3221226221', // CCTV5+			
    'D93CCTV6' => '3221226393', // CCTV6			
    'D93CCTV7' => '3221226192', // CCTV-7			
    'D93CCTV8' => '3221226391', // CCTV8			
    'D93CCTV9' => '3221226197', // CCTV9			
    'D93CCTV10' => '3221226189', // CCTV-10			
    'D93CCTV11' => '3221226240', // CCTV-11			
    'D93CCTV12' => '3221226190', // CCTV-12			
    'D93CCTV13' => '3221226233', // CCTV-13			
    'D93CCTV14' => '3221226193', // CCTV-14			
    'D93CCTV16' => '3221226921', // CCTV-16			
    'D93CCTV17' => '3221226198', // CCTV-17			
    'D93CHCJTY' => '3221226462', // CHC家庭影院			
    'D93CHCGQDY' => '3221226463', // CHC高清电影			
    'D93CHCDZDY' => '3221226465', // CHC动作电影			
    'D93DFW1' => '3221225797', // 东方卫视			
    'D93DFW' => '3221226217', // 东方卫视			
    'D93DNWS' => '3221225766', // 东南卫视			
    'D93GSW' => '3221225754', // 甘肃卫视			
    'D93GDWS1' => '3221225803', // 广东卫视			
    'D93GDWS' => '3221226216', // 广东卫视			
    'D93GXWS' => '3221225770', // 广西卫视			
    'D93GZWS' => '3221225793', // 贵州卫视			
    'D93HNWS' => '3221225769', // 海南卫视			
    'D93HBWS' => '3221225750', // 河北卫视			
    'D93HNWS' => '3221225767', // 河南卫视			
    'D93HLJWS' => '3221225802', // 黑龙江卫视			
    'D93HLJWS' => '3221226215', // 黑龙江卫视			
    'D93HBWS1' => '3221226206', // 湖北卫视			
    'D93HBWS' => '3221226194', // 湖北卫视			
    'D93HNJYJS' => '3221226351', // 湖南金鹰纪实			
    'D93HNWS1' => '3221225799', // 湖南卫视			
    'D93HNWS' => '3221226211', // 湖南卫视			
    'D93JLWS' => '3221225792', // 吉林卫视			
    'D93JSRW' => '3221226243', // 纪实人文			
    'D93JTLC' => '3221226244', // 家庭理财			
    'D93JSWS1' => '3221225800', // 江苏卫视			
    'D93JSWS' => '3221226200', // 江苏卫视			
    'D93JXWS' => '3221225764', // 江西卫视			
    'D93KBWS' => '3221226234', // 康巴卫视			
    'D93KLCD' => '3221226805', // 快乐垂钓			
    'D93LNWS1' => '3221226201', // 辽宁卫视			
    'D93LNWS' => '3221226210', // 辽宁卫视			
    'D93NFWS' => '3221226218', // 南方卫视			
    'D93NMGWS' => '3221225786', // 内蒙古卫视			
    'D93NXWS' => '3221225748', // 宁夏卫视			
    'D93QHWS' => '3221225794', // 青海卫视			
    'D93XMWS' => '3221226219', // 厦门卫视			
    'D93SDWS' => '3221226209', // 山东卫视			
    'D93SXWS' => '3221225763', // 山西卫视			
    'D93SXWS' => '3221225821', // 陕西卫视			
    'D93SHJSRW' => '3221226230', // 上海纪实人文			
    'D93SZWS1' => '3221225801', // 深圳卫视			
    'D93SZWS' => '3221226205', // 深圳卫视			
    'D93SCWS' => '3221225768', // 四川卫视			
    'D93TJWS' => '3221226204', // 天津卫视			
    'D93XZWS' => '3221226212', // 西藏卫视			
    'D93XJWS' => '3221225747', // 新疆卫视			
    'D93YTCQ' => '3221226245', // 弈坛春秋			
    'D93YNWS' => '3221225751', // 云南卫视			
    'D93ZJWS1' => '3221225798', // 浙江卫视			
    'D93ZJWS' => '3221226199', // 浙江卫视			
    'D93CQWS' => '3221226202', // 重庆卫视			
    'D93ADWS' => '3221226228', // 安多卫视			
    'D93AHWS1' => '3221226203', // 安徽卫视			
    'D93AHWS' => '3221226196', // 安徽卫视			
    'D93BJWS' => '3221226222', // 北京卫视			
    'D93BTWS' => '3221226214', // 兵团卫视			
    'D93CFTX' => '3221226350', // 财富天下			
    'D93CPD' => '3221226808', // 茶频道			
    'D93SXBCSH' => '3221226359', // SXBC生活			
    'D93SXBCXWZX' => '3221226357', // SXBC新闻资讯			
    'D93SXBCDSQC' => '3221226358', // SXBC都市青春			
    'D93SXBCYS' => '3221226360', // SXBC影视			
    'D93SXBCGG' => '3221226361', // SXBC公共			
    'D93SXBCLJGW' => '3221226362', // SXBC乐家购物			
    'D93SXBCTYXX' => '3221226363', // SXBC体育休闲			
    'D93SXBCXB DY' => '3221226364', // SXBC西部电影			
    'D93SSZB' => '3221226408', // 陕视直播			
    'D93XSRM' => '3221226556', // 西乡融媒			
    'D93YXDST1' => '3221226938', // 洋县电视台-1			
    'D93NQ1' => '3221226390', // 宁强-1			
    'D93NQ2HD' => '3221226389', // 宁强-2HD			
    'D93BJ1HD' => '3221226383', // 宝鸡1HD			
    'D93BJ1' => '3221226381', // 宝鸡1			
    'D93BJ2HD' => '3221226384', // 宝鸡2HD			
    'D93BJ2' => '3221226382', // 宝鸡2			
    'D93XASLPD' => '3221226370', // 西安丝路频道			
    'D93XAYSPD' => '3221226369', // 西安影视频道			
    'D93XASWZX' => '3221226368', // 西安商务资讯			
    'D93XADSPD' => '3221226367', // 西安都市频道			
    'D93XAXWZH' => '3221226366', // 西安新闻综合			
    'D93XAJYDST' => '3221226371', // 西安教育电视台			
    'D93YAYATV1' => '3221226386', // 延安YATV-1			
    'D93YAYATV2GGPD' => '3221226375', // 延安YATV-2公共频道			
    'D93SL1' => '3221226378', // 商洛-1			
    'D93XY1' => '3221226372', // 咸阳-1			
    'D93XWZH' => '3221226376', // 新闻综合			
    'D93YLDST' => '3221226373', // 杨凌电视台			
    'D93SXHZ1' => '3221226331', // 陕西汉中-1			
    'D93SXHZ2' => '3221225990', // 陕西汉中-2			
    'D93SXHZ3' => '3221225991', // 陕西汉中-3			
    'D93JCZY' => '3221226009', // 精彩综艺			
    'D93JCTY' => '3221226010', // 精彩体育			
    'D93JCDSJ' => '3221226012', // 精彩电视剧			
    'D93LJGW' => '3221226365', // 乐家购物			
    'D93YGGW' => '3221226032', // 央广购物			
    'D93HXGW' => '3221226018', // 好享购物			
    'D93JYGW' => '3221226355', // 家有购物			
    'D93FSGW' => '3221226326', // 风尚购物			
    'D93KLG' => '3221226353', // 快乐购			
    'D93YGW' => '3221226356', // 优购物			
    'D93JJGW' => '3221226354', // 家家购物			
    			
    			
    			
    			
    			
    			
    			
    '90CCTV15' => '3221225785', // CCTV15					
    '90ZJWS' => '3221225798', // 浙江卫视			
    '90TJWS' => '3221226204', // 天津卫视			
    '90HNWS' => '3221225799', // 湖南卫视			
    '90DFW' => '3221225797', // 东方卫视			
    '90JSWS' => '3221225800', // 江苏卫视			
    '90LNWS' => '3221226201', // 辽宁卫视			
    '90BJWS' => '3221225796', // 北京卫视			
    '90GDWS' => '3221225803', // 广东卫视			
    '90HBWS' => '3221226206', // 湖北卫视			
    '90SDWS' => '3221226209', // 山东卫视			
    '90SZWS' => '3221225801', // 深圳卫视			
    '90CQWS' => '3221226202', // 重庆卫视			
    '90AHWS' => '3221226203', // 安徽卫视			
    '90HLJWS' => '3221225802', // 黑龙江卫视			
    '90CGTN' => '3221225745', // CGTN			
    '90JCZY' => '3221226009', // 精彩综艺			
    '90HNJYJS' => '3221226351', // 湖南金鹰纪实			
    '90SHDYCJ' => '3221226966', // 上海第一财经			
    '90SHJSRW' => '3221226230', // 上海纪实人文			
    '90BJTYXX' => '3221226232', // 北京体育休闲			
    '90HNKLCD' => '3221226805', // 湖南快乐垂钓			
    '90CGTN' => '3221225745', // CGTN			
    '90JCZY' => '3221226009', // 精彩综艺			
    '90HNCPD' => '3221226808', // 湖南茶频道			
    '90SiTVYXFY' => '3221226579', // SiTV游戏风云			
    '90SiTVDSJC' => '3221226581', // SiTV都市剧场			
    '90NewTVYBJK' => '3221226957', // NewTV怡伴健康			
    '90DBDJ' => '3221226951', // 哒啵电竞			
    '90DBSS' => '3221226954', // 哒啵赛事			
    '90JCDSJGQ' => '3221226012', // 精彩电视剧高清			
    '90CHCJTY' => '3221226462', // CHC家庭影院			
    '90CHCGQDY' => '3221226463', // CHC高清电影			
    '90CHCDZDY' => '3221226465', // CHC动作电影			
    '90LY' => '3221226580', // 乐游			
    '90FP' => '3221226454', // 佛坪			
    '90QY' => '3221226945', // 千阳			
    '90SL1' => '3221226378', // 商洛1			
    '90CG' => '3221226920', // 城固			
    '90NQ1' => '3221226390', // 宁强1			
    '90NQ2' => '3221226389', // 宁强2			
    '90AK' => '3221226385', // 安康			
    			
    			
    			
    '93FYZQ' => '3221226984', // 风云足球			
    '93YSTQ' => '3221226956', // 央视台球			
    '93GEFWQ' => '3221226978', // 高尔夫网球			
    '93SJDL' => '3221226947', // 世界地理			
    '93FYJC' => '3221226950', // 风云剧场			
    '93FYYL' => '3221226953', // 风云音乐			
    '93DYJC' => '3221226959', // 第一剧场			
    '93HJJC' => '3221226972', // 怀旧剧场			
    '93BQKJ' => '3221226975', // 兵器科技			
    '93DSZN' => '3221226987', // 电视指南			
    '93YSJP' => '3221226981', // 央视精品			
    '93YSSS' => '3221226969', // 央视时尚			
    '93SXWS' => '3221225821', // 陕西卫视			
    '93BJWS' => '3221226222', // 北京卫视			
    '93LNWS' => '3221226201', // 辽宁卫视			
    '93CQWS' => '3221226202', // 重庆卫视			
    '93AHWS' => '3221226203', // 安徽卫视			
    '93HBWS' => '3221226206', // 湖北卫视			
    '93SDWS' => '3221226209', // 山东卫视			
    '93TJWS' => '3221226204', // 天津卫视			
    '93XCWS' => '3221226212', // 西藏卫视			
    '93BTWS' => '3221226214', // 兵团卫视			
    '93NFWS' => '3221226218', // 南方卫视			
    '93XMWS' => '3221226219', // 厦门卫视			
    			
    			
    '88ZJWS' => '3221225798', // 浙江卫视			
    '88HNWS' => '3221225799', // 湖南卫视			
    '88JSWS' => '3221225800', // 江苏卫视			
    '88DFWS' => '3221225797', // 东方卫视			
    '88JXWS' => '3221225764', // 江西卫视			
    '88JLWS' => '3221225792', // 吉林卫视			
    '88SXWS' => '3221225763', // 山西卫视			
    '88GZWS' => '3221225793', // 贵州卫视			
    '88QHWS' => '3221225794', // 青海卫视			
    '88NMGWS' => '3221225786', // 内蒙古卫视			
    '88YNWS' => '3221225751', // 云南卫视			
    '88HBWS' => '3221225750', // 河北卫视			
    '88NXWS' => '3221225748', // 宁夏卫视			
    '88XJWS' => '3221225747', // 新疆卫视			
    '88GSWS' => '3221225754', // 甘肃卫视			
    '88GXWS' => '3221225770', // 广西卫视			
    '88HNWS' => '3221225769', // 海南卫视			
    '88SCWS' => '3221225768', // 四川卫视			
    '88HNWS' => '3221225767', // 河南卫视			
    '88DNWS' => '3221225766', // 东南卫视			
    '88GDWS' => '3221225803', // 广东卫视			
    '88HLJWS' => '3221225802', // 黑龙江卫视			
    '88SZWS' => '3221225801', // 深圳卫视			

];

$ipArray = [
    'dbiptv.sn.chinamobile.com',
];
$ip = $ipArray[array_rand($ipArray)];

$playurl1 = "http://{$ip}/PLTV/88888890/224/{$n[$id]}/index.m3u8";
$playurl2 = "http://{$ip}/TVOD/88888893/224/{$n[$id]}/index.m3u8";
$playurl3 = "http://{$ip}/PLTV/88888888/224/{$n[$id]}/index.m3u8";
$playurl4 = "http://{$ip}/PLTV/88888893/224/{$n[$id]}/index.m3u8";

if (in_array($id, ['88HNWS', '88JSWS', '88DFWS', '88JXWS', '88JLWS', '88SXWS', '88GZWS', '88QHWS', '88NMGWS', '88YNWS', '88HBWS', '88NXWS', '88XJWS', '88GSWS', '88GXWS', '88HNWS', '88SCWS', '88HNWS', '88DNWS', '88GDWS', '88HLJWS', '88SZWS', '88ZJWS'])) {
    $playurl = $playurl3;
} elseif (in_array($id, ['D93CCTV1', 'D93CCTV2', 'D93CCTV3', 'D93CCTV4', 'D93CCTV5', 'D93CCTV50', 'D93CCTV6', 'D93CCTV7', 'D93CCTV8', 'D93CCTV9', 'D93CCTV10', 'D93CCTV11', 'D93CCTV12', 'D93CCTV13', 'D93CCTV14', 'D93CCTV16', 'D93CCTV17', 'D93CHCJTY', 'D93CHCGQDY', 'D93CHCDZDY', 'D93DFW1', 'D93DFW', 'D93DNWS', 'D93GSW', 'D93GDWS1', 'D93GDWS', 'D93GXWS', 'D93GZWS', 'D93HNWS', 'D93HBWS', 'D93HNWS', 'D93HLJWS', 'D93HLJWS', 'D93HBWS1', 'D93HBWS', 'D93HNJYJS', 'D93HNWS1', 'D93HNWS', 'D93JLWS', 'D93JSRW', 'D93JTLC', 'D93JSWS1', 'D93JSWS', 'D93JXWS', 'D93KBWS', 'D93KLCD', 'D93LNWS1', 'D93LNWS', 'D93NFWS', 'D93NMGWS', 'D93NXWS', 'D93QHWS', 'D93XMWS', 'D93SDWS', 'D93SXWS', 'D93SXWS', 'D93SHJSRW', 'D93SZWS1', 'D93SZWS', 'D93SCWS', 'D93TJWS', 'D93XZWS', 'D93XJWS', 'D93YTCQ', 'D93YNWS', 'D93ZJWS1', 'D93ZJWS', 'D93CQWS', 'D93ADWS', 'D93AHWS1', 'D93AHWS', 'D93BJWS', 'D93BTWS', 'D93CFTX', 'D93CPD', 'D93SXBCSH', 'D93SXBCXWZX', 'D93SXBCDSQC', 'D93SXBCYS', 'D93SXBCGG', 'D93SXBC LJGW', 'D93SXBC TYXX', 'D93SXBC XB DY', 'D93SSZB', 'D93XSRM', 'D93YX DST1', 'D93NQ1', 'D93NQ2HD', 'D93BJ1HD', 'D93BJ1', 'D93BJ2HD', 'D93BJ2', 'D93XASLPD', 'D93XAYSPD', 'D93XASWZX', 'D93XADSPD', 'D93XAXWZH', 'D93XAJYDST', 'D93YAYATV1', 'D93YAYATV2GGPD', 'D93SL1', 'D93XY1', 'D93XWZH', 'D93YL DST', 'D93SXHZ1', 'D93SXHZ2', 'D93SXHZ3', 'D93JCZY', 'D93JCTY', 'D93JCDSJ', 'D93LJGW', 'D93YGGW', 'D93HXGW', 'D93JYGW', 'D93FSGW', 'D93KLG', 'D93YGW', 'D93JJGW'])) {
    $playurl = $playurl2;
} elseif (in_array($id, ['90CCTV15', '90ZJWS', '90TJWS', '90HNWS', '90DFW', '90JSWS', '90LNWS', '90BJWS', '90GDWS', '90HBWS', '90SDWS', '90SZWS', '90CQWS', '90AHWS', '90HLJWS', '90CGTN', '90JCZY', '90HNJYJS', '90SHDYCJ', '90SHJSRW', '90BJTYXX', '90HNKLCD', '90CGTN', '90JCZY', '90HNCPD', '90SiTVYXFY', '90SiTVDSJC', '90NewTVYBJK', '90DBDJ', '90DBSS', '90JCDSJGQ', '90CHCJTY', '90CHCGQDY', '90CHCDZDY', '90LY', '90FP', '90QY', '90SL1', '90CG', '90NQ1', '90NQ2', '90AK'])) {
    $playurl = $playurl1;
} elseif (in_array($id, ['93FYZQ', '93YSTQ', '93GEFWQ', '93SJDL', '93FYJC', '93FYYL', '93DYJC', '93HJJC', '93BQKJ', '93DSZN', '93YSJP', '93YSSS', '93SXWS', '93BJWS', '93LNWS', '93CQWS', '93AHWS', '93HBWS', '93SDWS', '93TJWS', '93XCWS', '93BTWS', '93NFWS', '93XMWS'])) {
    $playurl = $playurl4;
} else {
    $playurl = $playurl4; // 默认使用 $playurl4
}

header('Location: ' . $playurl);
exit;
